/*Создайте класс Complex(комплексное число) или исполь -
зуйте уже созданный вами класс.Создайте перегруженные
операторы для реализации арифметических операций для
по работе с комплексными числами(операции + , -, *, / ).*/


Начальные сведения о мнимых и комплексных числах приведены в разделе «Мнимые и комплексные числа».
Необходимость в этих числах нового типа появилась при решении квадратных уравнений для случая  D < 0 
	(здесь D – дискриминант квадратного уравнения).
	Долгое время эти числа не находили физического применения, поэтому их и назвали «мнимыми» числами.
	Однако сейчас они очень широко применяются в различных областях физики
	и техники : электротехнике, гидро - и аэродинамике, теории упругости и др.
	Комплексные числа  записываются в виде : a + bi.Здесь  a и  b – действительные числа,
	а  i – мнимая единица, т.e.i 2 = –1.Число  a называется абсциссой, a  b – ординатой комплексного числа  a + bi.
	Два комплексных числа  a + bi и  a – bi называются сопряжёнными комплексными числами.

	Основные договорённости :
1.  Действительное число  а  может быть также записано в форме комплексного числа : a + 0 i  или  a – 0 i.Например, записи  5 + 0 i  и  5 – 0 i  означают одно и то же число  5 .

2.  Комплексное число 0 + bi  называется чисто мнимым числом.Запись bi означает то же самое, что и  0 + bi.

3.  Два комплексных числа  a + bi и c + di считаются равными, если  a = c и b = d.В противном случае комплексные числа не равны.


Сложение.Суммой комплексных чисел  a + bi  и  c + di  называется комплексное число(a + c) + (b + d) i.
Таким образом, при сложении комплексных чисел отдельно складываются их абсциссы и ординаты.

Это определение соответствует правилам действий с обычными многочленами.

Вычитание.Разностью двух комплексных чисел  a + bi(уменьшаемое) и c + di(вычитаемое) называется комплексное число(a – c) + (b – d) i.

Таким образом, при вычитании двух комплексных чисел отдельно вычитаются их абсциссы и ординаты.

Умножение.Произведением комплексных чисел  a + bi  и  c + di называется комплексное число :

(ac – bd) + (ad + bc) i.Это определение вытекает из двух требований :
1)  числа  a + bi  и  c + di должны перемножаться, как алгебраические двучлены,
2)  число i  обладает основным свойством : i 2 = –1.

